const CONSTANTS = {
    LANGUAGE: {
        EN_US: 'EN_US',
        UA_UA: 'UA_UA',
        PL_PL: 'PL_PL',
        DE_DE: 'DE_DE'
    },
    THEMES: {
        DARK: 'DARK',
        LIGHT: 'LIGHT'
    }
}

export default CONSTANTS;

// ENUM -  набір іменованих констант. ENUM використовується для створення змінних, які можуть приймати обмежений набір значень. Це допомагає забезпечити більшу безпеку коду, оскільки значення змінної обмежені заздалегідь визначеним списком. ENUM використовується для створення змінних, які можуть приймати обмежений набір значень. Це допомагає забезпечити більшу безпеку коду, оскільки значення змінної обмежені заздалегідь визначеним списком.